{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "What's up",
        "Good morning",
        "Good day",
        "Peace be upon you",
        "Greetings",
        "Hey",
        "Yo",
        "How are you",
        "What's new",
        "Let's go",
        "Hi there",
        "How's it going",
        "Hey buddy",
        "How are you doing"
      ],
      "responses": [
        "Hey, how's it going?",
        "Hello! How can I assist you?",
        "Good morning! How can I help you today?",
        "Good day! What would you like to talk about?",
        "Peace be upon you! How can I assist you?",
        "Hey! How are you feeling today?",
        "Yo! How's it going? If you have any questions, I'm here!",
        "Hey! What's up, what's on your mind?"
      ]
    },
    {
      "tag": "shipping",
      "patterns": [
        "When will my package arrive",
        "What is the shipping status",
        "Where is my order",
        "Order tracking",
        "Shipping info",
        "How can I track my package",
        "How long does it take for the order to arrive",
        "When will my package be delivered",
        "Has my package arrived?",
        "How can I check my package status",
        "Is my package shipped yet",
        "What is the status of my order",
        "When will I get my tracking number"
      ],
      "responses": [
        "Your package will arrive in 1-3 days!",
        "You can track your order using the tracking code.",
        "Your package is on its way and will reach you soon.",
        "Use the tracking number to check the status of your order.",
        "Shipping time may vary depending on your location, be patient!",
        "Your package is out for delivery and will be with you in a few days.",
        "You can follow your order step-by-step using the tracking link.",
        "Your package is on its way, please be patient.",
        "Your tracking number: [Tracking Code] - you can check it now."
      ]
    },
    {
      "tag": "return",
      "patterns": [
        "I want to return a product",
        "How do I return an item",
        "Can I get my money back",
        "Return process",
        "Returning the product",
        "Is return possible",
        "Wrong item arrived",
        "I'm not satisfied",
        "I want to exchange it",
        "I want to change the product",
        "What is the return policy",
        "How is my return request processed",
        "You sent the wrong size",
        "The product is damaged"
      ],
      "responses": [
        "You have 14 days for returns, check our support page for details.",
        "Follow this link for the return process: https://yoursite.com/return",
        "To return the item, prepare the package and send it back to us.",
        "For more information about the return process, contact customer service.",
        "You can return your product within 14 days, make sure to do it within that period.",
        "To return the item, send back the package and fill out the return form.",
        "Returns are accepted only for unused products with tags attached.",
        "To start the return process, just provide your email and order number.",
        "If you received the wrong item, you can request an exchange."
      ]
    },
    {
      "tag": "payment",
      "patterns": [
        "What payment methods are available",
        "Can I pay by card",
        "Do you have cash on delivery",
        "How do I make a payment",
        "Do you accept credit cards",
        "Can I pay by wire transfer",
        "Can I pay online",
        "Can I pay via PayPal",
        "How does the payment process work",
        "How do I get the invoice",
        "I'm having an issue with my payment"
      ],
      "responses": [
        "We accept credit cards, debit cards, and cash on delivery.",
        "You can pay with any card, it's a secure transaction!",
        "We also offer cash on delivery as an option.",
        "You can also pay by wire transfer.",
        "PayPal, credit card, and debit card payments are accepted.",
        "For online payments, you can use your credit card or prefer a bank transfer.",
        "You can make a payment after confirming your order with cash on delivery.",
        "You can securely pay with your credit card on our website.",
        "Your payment was successful! You can receive your invoice by email."
      ]
    },
    {
      "tag": "thank_you",
      "patterns": [
        "Thank you",
        "Thanks",
        "I really appreciate it",
        "Thanks a lot",
        "Thank you so much",
        "Thanks for your help",
        "Thanks for everything",
        "Thank you for your time"
      ],
      "responses": [
        "You're welcome, always happy to help!",
        "I'm always here to assist you!",
        "Thank you, wishing you a great day!",
        "No problem, let me know if you have any other questions.",
        "You're welcome, if you need anything else, just ask!",
        "I'm happy to help anytime, thanks!",
        "You're welcome, can I help with anything else?",
        "Thank you! Is there anything else I can assist with?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye",
        "See you",
        "Bye bye",
        "I'm leaving",
        "Talk to you later",
        "See you later",
        "Take care",
        "Catch you later",
        "Until next time",
        "Goodbye, take care",
        "See you soon",
        "See you next time"
      ],
      "responses": [
        "See you, take care!",
        "Goodbye, I'm here if you need help again.",
        "Have a great day, come back anytime!",
        "Goodbye! If you need help, I'm here.",
        "See you later, take care!",
        "Talk to you next time, have a great day!",
        "Goodbye! If you need help again, just come back.",
        "See you, I'm always here if you need me!"
      ]
    },
    {
      "tag": "product_info",
      "patterns": [
        "What color is the product",
        "What sizes are available",
        "Tell me about the product",
        "What fabric is it",
        "Is the shorts cotton",
        "What are the washing instructions",
        "Which collection is this product from",
        "What are the product measurements",
        "What is the product description",
        "What are the product features",
        "What products are currently available",
        "What is the stock status of the product",
        "What color options are available"
      ],
      "responses": [
        "Our product is made of 100% cotton and has a very comfortable fit.",
        "Sizes available are S, M, L, and XL.",
        "Washing instructions are included on the product label. Generally, it's recommended to wash it at 30°C.",
        "This product is part of our new season Urban Collection.",
        "The fabric is a blend of 80% cotton and 20% polyester.",
        "Washing instructions recommend washing at 30°C.",
        "You can check the size chart on our website.",
        "This shorts has a comfortable fabric and is perfect for everyday use.",
        "Currently popular colors are Black and Navy!"
      ]
    },
    {
      "tag": "order",
      "patterns": [
        "Where is my order",
        "How can I place an order",
        "What is the order status",
        "Can I cancel my order",
        "When will I receive my order",
        "Can I track my order",
        "Why hasn't my order arrived",
        "My order delivery is delayed",
        "I had an issue while placing the order"
      ],
      "responses": [
        "Your order has been successfully placed and is being processed.",
        "To cancel your order, please contact customer service.",
        "You can check the status of your order on our website.",
        "You can track your order using the tracking number.",
        "Your order is being prepared and will be shipped in a few days.",
        "Your order is on its way and will be delivered in a few days.",
        "Your order delivery may be delayed, sorry for the inconvenience.",
        "You will receive an email notification once your order is placed."
      ]
    },
    {
      "tag": "unknown",
      "patterns": [],
      "responses": [
        "Sorry, I didn't understand that. Would you like to talk to live support?",
        "I need more information. Can you phrase that differently?",
        "I didn't catch that, please ask something else or talk to live support.",
        "I didn't understand, would you like to ask something else?",
        "Sorry, I can't assist with that. Feel free to ask anything else!"
      ]
    }
  ]
}
